# 30초 안에 코딩해보기
# 파이썬으로 프로그래밍을 하시기 위해서는 PyCharm, Python 3 등을 컴퓨터에 설치해야 합니다. 하지만 처음 코딩을 배우는 입장에서는 그 설치 과정이 귀찮고 어려울 수 있습니다. 코드잇에서는 이러한 프로그램을 설치하지 않으시더라도 웹에서 바로 프로그래밍을 시작하실 수 있도록, 온라인 상에서 코딩하실 수 있는 에디터를 제공하고 있습니다.

# 귀찮은 설치 과정은 코딩을 맛본 이후로 잠시 미뤄두고, 30초 안에 직접 코딩을 해볼까요?

# Hello world! 출력하기
# (1) 우측의 빈 에디터에 아래와 같이 print("Hello world!")를 써주세요. Hello world! 라는 글자들을 출력하라는 명령입니다.

# print("Hello world!")
# (2) 이제 실행하기 위해서 하단의 실행 버튼을 누릅니다.

# (3) 밑에 창에 Hello world!라고 나오죠? 이 밑에 있는 창을 콘솔(Console)이라고 부르고, 우리가 프로그램에서 print하는 건 모두 이 콘솔 창에 나올겁니다.

# 여러분은 방금 30초만에 첫 번째 Python 코딩을 해보셨습니다. 어때요, 참 쉽죠? 앞으로 하게될 코딩들도 이 것만큼 쉽고, 이 것보다 훨씬 재밌으니 차근차근 시작해봅시다!

print("Hello World")

# 숫자 출력
print(5)
print(3 + 7)
